Given the following DataFrame, write a Python program using Pandas to extract all rows where the price is greater than or equal to 20,000 and sort them in descending order by price.



data = {

    'Product': ['Laptop', 'Desktop', 'Tablet', 'Phone', 'Smartwatch'],

    'Price': [25000, 12000, 8000, 22000, 5000]

}



df = pd.DataFrame(data)

In [28]:
import numpy as np
import pandas as pd

In [29]:
data = {

    'Product': ['Laptop', 'Desktop', 'Tablet', 'Phone', 'Smartwatch'],

    'Price': [25000, 12000, 8000, 22000, 5000]

}


df = pd.DataFrame(data)

In [30]:
df.head()

      Product  Price
0      Laptop  25000
1     Desktop  12000
2      Tablet   8000
3       Phone  22000
4  Smartwatch   5000

In [31]:
df['Price'] >= 20000

0     True
1    False
2    False
3     True
4    False
Name: Price, dtype: bool

In [32]:
df[df['Price'] >= 20000]

  Product  Price
0  Laptop  25000
3   Phone  22000

In [33]:
df[df['Price'] >= 20000].sort_values(by='Price', ascending=False)

  Product  Price
0  Laptop  25000
3   Phone  22000

Write a Python program using Pandas to create a DataFrame from the given data and find the total revenue and average price of items sold in each store.

In [34]:
data = {

    'Store': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],

    'Item': ['Apple', 'Banana', 'Orange', 'Grape', 'Apple', 'Banana', 'Orange', 'Grape'],

    'Price': [50, 20, 30, 60, 55, 22, 33, 65],

    'Quantity': [10, 12, 15, 16, 20, 25, 30, 35]

}

In [35]:
df = pd.DataFrame(data)
df.head()

  Store    Item  Price  Quantity
0     A   Apple     50        10
1     B  Banana     20        12
2     A  Orange     30        15
3     B   Grape     60        16
4     A   Apple     55        20

In [36]:
def revenue_avgprice(df):
    total_revenue = df['Price'] * df['Quantity']
    print(f'Total Revenue: ${total_revenue.sum()}')
    
    avg_price = df['Price'].mean()
    print(f'Average Price ${avg_price}')
    
revenue_avgprice(df)

Total Revenue: $7065
Average Price $41.875

In [37]:
import pandas as pd

data = {
    'Store': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Item': ['Apple', 'Banana', 'Orange', 'Grape', 'Apple', 'Banana', 'Orange', 'Grape'],
    'Price': [50, 20, 30, 60, 55, 22, 33, 65],
    'Quantity': [10, 12, 15, 16, 20, 25, 30, 35]
}

df = pd.DataFrame(data)
df['Revenue'] = df['Price'] * df['Quantity']

# Setting a multi-level index on Store and Item
df.set_index(['Store', 'Item'], inplace=True)

# Using xs to extract data for Store 'A'
store_a_data = df.xs('A', level='Store')

# Calculating total revenue and average price for Store 'A'
total_revenue_a = store_a_data['Revenue'].sum()
avg_price_a = store_a_data['Price'].mean()

print(f"Total Revenue for Store A: {total_revenue_a}")
print(f"Average Price for Store A: {avg_price_a}")

Total Revenue for Store A: 3040
Average Price for Store A: 42.0

In [38]:
import pandas as pd

data = {
    'Store': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Item': ['Apple', 'Banana', 'Orange', 'Grape', 'Apple', 'Banana', 'Orange', 'Grape'],
    'Price': [50, 20, 30, 60, 55, 22, 33, 65],
    'Quantity': [10, 12, 15, 16, 20, 25, 30, 35]
}

df = pd.DataFrame(data)
df['Revenue'] = df['Price'] * df['Quantity']

result = df.groupby('Store').agg({'Revenue': 'sum', 'Price': 'mean'}).reset_index()
print(result)

  Store  Revenue  Price
0     A     3040  42.00
1     B     4025  41.75

In [39]:
def revenue_avgprice(df):
    df = pd.DataFrame(data)
    df['Revenue'] = df['Price'] * df['Quantity']
    result = df.groupby('Store').agg({'Revenue': 'sum', 'Price': 'mean'}).reset_index()
    
    print(result)

    

revenue_avgprice(df)

  Store  Revenue  Price
0     A     3040  42.00
1     B     4025  41.75

In [40]:
import pandas as pd

data = {
    'Store': ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],
    'Item': ['Apple', 'Banana', 'Orange', 'Grape', 'Apple', 'Banana', 'Orange', 'Grape'],
    'Price': [50, 20, 30, 60, 55, 22, 33, 65],
    'Quantity': [10, 12, 15, 16, 20, 25, 30, 35]
}

df = pd.DataFrame(data)

df['Revenue'] = df['Price'] * df['Quantity']

filtered_df = df[df['Store'].isin(['A', 'B'])]

result = filtered_df.groupby('Store').agg(Total_Revenue=('Revenue', 'sum'), Average_Price=('Price', 'mean')).reset_index()

print(result)

  Store  Total_Revenue  Average_Price
0     A           3040          42.00
1     B           4025          41.75

Write a Python program using Pandas to create a DataFrame from the given data and calculate the total amount spent by each customer.

In [41]:
data = {

    'Customer': ['Alice', 'Bob', 'Alice', 'Alice', 'Bob', 'Bob', 'Alice', 'Bob'],

    'Item': ['Pen', 'Pencil', 'Notebook', 'Eraser', 'Pen', 'Pencil', 'Notebook', 'Eraser'],

    'Price': [10, 5, 50, 20, 10, 5, 50, 20],

    'Quantity': [3, 4, 2, 5, 10, 6, 1, 2]

}

In [42]:
df = pd.DataFrame(data)

In [45]:

df['Total_Spent'] = df['Price'] * df['Quantity']

In [50]:
result = df.groupby('Customer').agg({'Total_Spent': 'sum'}).reset_index()

In [51]:
result

  Customer  Total_Spent
0    Alice          280
1      Bob          190

In [52]:

data = {

    'Category': ['Fruit', 'Vegetable', 'Fruit', 'Vegetable', 'Fruit', 'Vegetable'],

    'Name': ['Apple', 'Carrot', 'Banana', 'Potato', 'Grape', 'Onion'],

    'Price': [2, 1, 1.5, 0.5, 3, 1],

    'Quantity': [10, 20, 15, 30, 5, 40]

}



df = pd.DataFrame(data)



fruits = df[df['Category'] == 'Fruit']

total_fruit_value = fruits['Price'].sum() * fruits['Quantity'].sum()

print(total_fruit_value)

195.0

In [53]:
data = {

    'Name': ['Alice', 'Bob', 'Charlie', 'David'],

    'Age': [25, 30, 35, 40],

    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']

}



df = pd.DataFrame(data)



result = df[df['Age'] >= 30].sort_values(by='Age', ascending=False).iloc[0]['City']

print(result)

Chicago

In [54]:
data = {

    'Product': ['A', 'B', 'C', 'A', 'B', 'C'],

    'Price': [100, 200, 300, 150, 250, 350],

    'Quantity': [10, 5, 7, 12, 8, 5]

}



df = pd.DataFrame(data)



total_revenue = (df['Price'] * df['Quantity']).sum()

average_price = df['Price'].mean()

print(total_revenue, average_price)

9650 225.0

Write a Python program using Pandas to create a DataFrame from the given data and find the total amount spent per item, as well as the total amount spent by all customers.

In [61]:
data = {

    'Customer': ['Alice', 'Bob', 'Alice', 'Alice', 'Bob', 'Bob', 'Alice', 'Bob'],

    'Item': ['Pen', 'Pencil', 'Notebook', 'Eraser', 'Pen', 'Pencil', 'Notebook', 'Eraser'],

    'Price': [10, 5, 50, 20, 10, 5, 50, 20],

    'Quantity': [3, 4, 2, 5, 10, 6, 1, 2]

}

In [62]:
df = pd.DataFrame(data)
df['total_amount_spent'] = df['Price'] * df['Quantity']

df

  Customer      Item  Price  Quantity  total_amount_spent
0    Alice       Pen     10         3                  30
1      Bob    Pencil      5         4                  20
2    Alice  Notebook     50         2                 100
3    Alice    Eraser     20         5                 100
4      Bob       Pen     10        10                 100
5      Bob    Pencil      5         6                  30
6    Alice  Notebook     50         1                  50
7      Bob    Eraser     20         2                  40

In [63]:
df.groupby('Item').agg({'total_amount_spent': 'sum'}).reset_index()

       Item  total_amount_spent
0    Eraser                 140
1  Notebook                 150
2       Pen                 130
3    Pencil                  50